In [2]:
import numpy as np
import pandas as pd
animals = pd.DataFrame({'kind': ['cat', 'dog', 'cat', 'dog'],
                         'height': [9.1, 6.0, 9.5, 34.0],
                         'weight': [7.9, 7.5, 9.9, 198.0]})

animals.groupby("kind").agg(
        min_height=('height', 'min'),
        max_height=('height', 'max'),
        sum_height=('height', 'sum'),
        average_weight=('weight', np.mean),
    )

      min_height  max_height  sum_height  average_weight
kind
cat          9.1         9.5        18.6            8.90
dog          6.0        34.0        40.0          102.75

In [10]:
from bolt4ds.ingest import pd_to_mysql,pd_readsql

In [8]:
pd_to_mysql(animals, 'mysql+mysqlconnector://root@127.0.0.1/boledw', 'all_uid_v5',if_exists='replace')

creating mysql.csv ok
loading mysql.csv ok

True

In [9]:
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [13]:
url = 'mysql+mysqlconnector://root@127.0.0.1/boledw'
sql = "select kind,height,weight from all_uid_v5"
pd_readsql(url,sql)

     0     1      2
0  cat   9.1    7.9
1  dog   6.0    7.5
2  cat   9.5    9.9
3  dog  34.0  198.0